# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash'
brew 'mas'
brew 'tree'
brew 'openssl'
brew 'graphviz'
brew 'nano'
brew 'zsh'
brew 'zsh-completions'
brew 'rectangle'

# Dev
brew 'gh'
brew 'git'
brew 'nvm'

# Docker
brew 'colima'
brew 'docker'
brew 'docker-compose'
brew 'docker-completion'
brew 'docker-buildx'

# Apps
cask 'zoom'
cask 'spotify'
cask 'notion'
cask 'github'
cask 'devcleaner'
cask 'whatsapp'
cask 'google-chrome'
cask 'jetbrains-toolbox'
cask 'iterm2'
cask 'alt-tab'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
