# Taps
tap 'homebrew/cask-fonts'

# Binaries
brew 'bash'
brew 'mas'
brew 'tree'
brew 'openssl'
brew 'graphviz'
brew 'nano'
brew 'zsh'
brew 'zsh-completions'
brew 'gpg'
brew 'gawk'
brew 'jq'

# Utilities
brew 'rectangle'
cask 'notunes'

# Dev
brew 'gh'
brew 'git'
brew 'nvm'

# Docker
brew 'colima'
brew 'docker'
brew 'docker-compose'
brew 'docker-completion'
brew 'docker-buildx'

# Apps
cask 'zoom'
cask 'spotify'
cask 'notion'
cask 'devcleaner'
cask 'whatsapp'
cask 'google-chrome'
cask 'iterm2'
cask 'alt-tab'
cask 'pocket-casts'
cask 'intellij-idea'
cask 'slack'
cask 'sublime-text'
cask 'devtoys'
cask 'postman'
cask 'the-unarchiver'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-fira-code'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
